**Pandas Concat**

In [39]:
import pandas as pd

In [40]:
india_weather={"city":["Pune","Mumbai","Delhi"],
              "temperature":[30,28,26],
              "humidity":[75,98,56]}

In [41]:
india_weather=pd.DataFrame(india_weather)

In [42]:
india_weather

     city  temperature  humidity
0    Pune           30        75
1  Mumbai           28        98
2   Delhi           26        56

In [43]:
usa_weather=pd.DataFrame({"city":["Atlanta","Seattle","New York City"],
                         "temperature":[30,12,6],
                         "humidity":[20,13,10]})

In [44]:
usa_weather

            city  temperature  humidity
0        Atlanta           30        20
1        Seattle           12        13
2  New York City            6        10

In [45]:
new_df=pd.concat([india_weather,usa_weather])

In [46]:
new_df

            city  temperature  humidity
0           Pune           30        75
1         Mumbai           28        98
2          Delhi           26        56
0        Atlanta           30        20
1        Seattle           12        13
2  New York City            6        10

In [47]:
new_df=pd.concat([india_weather,usa_weather],ignore_index=True)

In [48]:
new_df

            city  temperature  humidity
0           Pune           30        75
1         Mumbai           28        98
2          Delhi           26        56
3        Atlanta           30        20
4        Seattle           12        13
5  New York City            6        10

In [49]:
new_df=pd.concat([india_weather,usa_weather],keys=["india","usa"])

In [50]:
new_df

                  city  temperature  humidity
india 0           Pune           30        75
      1         Mumbai           28        98
      2          Delhi           26        56
usa   0        Atlanta           30        20
      1        Seattle           12        13
      2  New York City            6        10

In [51]:
new_df.loc["usa"]

            city  temperature  humidity
0        Atlanta           30        20
1        Seattle           12        13
2  New York City            6        10

In [52]:
new_df.loc["india"]

     city  temperature  humidity
0    Pune           30        75
1  Mumbai           28        98
2   Delhi           26        56

**Concatenation Using Index**

In [53]:
temperature_df=pd.DataFrame({"City":["Pune","Mumbai","Bangalore"],
                "Temperature":[28,32,30]},index=[0,1,2])
temperature_df

        City  Temperature
0       Pune           28
1     Mumbai           32
2  Bangalore           30

In [54]:
windspeed_df=pd.DataFrame({"City":["Mumbai","Pune"],
                          "Windspeed":[30,10]})
windspeed_df

     City  Windspeed
0  Mumbai         30
1    Pune         10

**Here it will give mumbai first and then pune in concatenated dataframe due to absence of index**

In [55]:
new_df1=pd.concat([temperature_df,windspeed_df],axis=1)   #axis=1 makes it arrange column wise or else rowwise ie: one below other
new_df1

        City  Temperature    City  Windspeed
0       Pune           28  Mumbai       30.0
1     Mumbai           32    Pune       10.0
2  Bangalore           30     NaN        NaN

**But here it'll give correct order since we have indexed it**

In [58]:
windspeed_df=pd.DataFrame({"City":["Mumbai","Pune"],
                          "Windspeed":[30,10]},index=[1,0])   
windspeed_df

     City  Windspeed
1  Mumbai         30
0    Pune         10

In [59]:
new_df1=pd.concat([temperature_df,windspeed_df],axis=1)
new_df1

        City  Temperature    City  Windspeed
0       Pune           28    Pune       10.0
1     Mumbai           32  Mumbai       30.0
2  Bangalore           30     NaN        NaN

**Concatinating a series with a dataframe**

In [60]:
s=pd.Series(["Humid","Dry","Windy"],name="event")

In [61]:
s

0    Humid
1      Dry
2    Windy
Name: event, dtype: object

In [65]:
new_df2=pd.concat([temperature_df,s],axis=1)

In [66]:
new_df2

        City  Temperature  event
0       Pune           28  Humid
1     Mumbai           32    Dry
2  Bangalore           30  Windy